build_your_private_ethereum_fullnode_on_debian_9_0.en.html
<!DOCTYPE html>
<html lang="en" prefix="og: http://ogp.me/ns# fb: https://www.facebook.com/2008/fbml">
<head>
    <title>Build your private ethereum fullnode on Debian 9.0 (Stretch) - Qin Fengling</title>
    <!-- Using the latest rendering mode for IE -->
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">



<link rel="canonical" href="./build_your_private_ethereum_fullnode_on_debian_9_0.en.html">

        <meta name="author" content="qinfengling" />
        <meta name="description" content="Ethereum is an open-source blockchain platform featuring smart contract functionality. If you want to try to learn the smart contract, the first of the important thing to do is install the ethereum fullnode. There are 3 type of networks: main network, public testnet and local private testnet. In this article …" />

        <meta property="og:site_name" content="Qin Fengling" />
        <meta property="og:type" content="article"/>
        <meta property="og:title" content="Build your private ethereum fullnode on Debian 9.0 (Stretch)"/>
        <meta property="og:url" content="./build_your_private_ethereum_fullnode_on_debian_9_0.en.html"/>
        <meta property="og:description" content="Ethereum is an open-source blockchain platform featuring smart contract functionality. If you want to try to learn the smart contract, the first of the important thing to do is install the ethereum fullnode. There are 3 type of networks: main network, public testnet and local private testnet. In this article …"/>
        <meta property="article:published_time" content="2017-12-23" />
            <meta property="article:section" content="Ethereum" />
            <meta property="article:author" content="qinfengling" />



    <!-- Bootstrap -->
        <link rel="stylesheet" href="./theme/css/bootstrap.min.css" type="text/css"/>
    <link href="./theme/css/font-awesome.min.css" rel="stylesheet">

    <link href="./theme/css/pygments/native.css" rel="stylesheet">
    <link rel="stylesheet" href="./theme/css/style.css" type="text/css"/>





</head>
<body>

<div class="navbar navbar-default navbar-fixed-top" role="navigation">
	<div class="container">
        <div class="navbar-header">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target=".navbar-ex1-collapse">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a href="./" class="navbar-brand">
Qin Fengling            </a>
        </div>
        <div class="collapse navbar-collapse navbar-ex1-collapse">
            <ul class="nav navbar-nav">
                        <li class="active">
                            <a href="./category/ethereum.html">Ethereum</a>
                        </li>
            </ul>
            <ul class="nav navbar-nav navbar-right">
            </ul>
        </div>
        <!-- /.navbar-collapse -->
    </div>
</div> <!-- /.navbar -->
<!-- Banner -->
<!-- End Banner -->
<div class="container">
    <div class="row">
        <div class="col-lg-12">
    <section id="content">
        <article>
            <header class="page-header">
                <h1>
                    <a href="./build_your_private_ethereum_fullnode_on_debian_9_0.en.html"
                       rel="bookmark"
                       title="Permalink to Build your private ethereum fullnode on Debian 9.0 (Stretch)">
                        Build your private ethereum fullnode on Debian 9.0 (Stretch)
                    </a>
                </h1>
            </header>
            <div class="entry-content">
                <div class="panel">
                    <div class="panel-body">
<footer class="post-info">
    <span class="label label-default">Date</span>
    <span class="published">
        <i class="fa fa-calendar"></i><time datetime="2017-12-23T00:00:00+08:00"> Sat 23 December 2017</time>
    </span>





    
</footer><!-- /.post-info -->                    </div>
                </div>
                <p>
Ethereum is an open-source blockchain platform featuring smart contract functionality.
</p>

<p>
If you want to try to learn the smart contract, the first of the important thing to do
</p>

<p>
is install the ethereum fullnode. There are 3 type of networks: main network, public testnet
</p>

<p>
and local private testnet. In this article, I will show you how to build a local private testnet
</p>

<p>
from the scratch. You can also use the script to reproduce identical network with me.
</p>

<p>
NOTE: The root directory for fullnode is ~/eth
</p>

<p>
I will demo the commands in detail, you can issue them in the bash terminal.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Install tools from the beginning (<b>Need root password</b>)</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-bash">sudo apt-get install -y build-essential git
mkdir ~/eth
cd ~/eth
curl -O https://storage.googleapis.com/golang/go1.7.3.linux-amd64.tar.gz
tar -xzf go1.7.3.linux-amd64.tar.gz
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Prepare the enviroment for fullnode compile</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-bash">mkdir ~/eth/go-workspace
export PATH=$PATH:~/eth/go/bin
export GOPATH=~/eth/go-workspace
export GOROOT=~/eth/go
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Clone &amp; build fullnode from sourcecode (go-ethereum)</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-bash">cd ~/eth
git clone https://github.com/ethereum/go-ethereum
cd go-ethereum
make geth
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Build the private ethereum testnet</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-bash">cd ~/eth
export PATH=$PATH:~/eth/go-ethereum/build/bin
mkdir ~/eth/myeth_data
cat &gt; myeth_genesis.json &lt;&lt; EOL
{
    "nonce": "0x0000000000000042",
    "timestamp": "0x00",
    "parentHash": "0x0000000000000000000000000000000000000000000000000000000000000000",
    "extraData": "0x00",
    "gasLimit": "0x8000000",
    "difficulty": "0x400",
    "mixhash": "0x0000000000000000000000000000000000000000000000000000000000000000",
    "coinbase": "0x3333333333333333333333333333333333333333",
    "alloc": {
     },
     "config": {
	"chainId": 15,
	"homesteadBlock": 0,
	"eip155Block": 0,
	"eip158Block": 0
    }
}
EOL
geth --identity "myeth" --datadir ~/eth/myeth_data --rpc --rpccorsdomain "*" --rpcapi "db,eth,net,web3" --networkid 1024 init "./myeth_genesis.json"
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Start the fullnode console</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-bash">geth --identity "myeth" --datadir ~/eth/myeth_data --networkid 1024 console
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Create account and start mining in the fullnode console</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-bash">personal.newAccount("password"); /* change password to your own */
miner.setEtherbase(personal.listAccounts[0])
miner.start()
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Reference</h2>
<div class="outline-text-2" id="text-7">
<p>
<a href="https://github.com/ethereum/go-ethereum/wiki/Installation-Instructions-for-Ubuntu">https://github.com/ethereum/go-ethereum/wiki/Installation-Instructions-for-Ubuntu</a>
</p>

<p>
<a href="https://github.com/ethereum/go-ethereum/wiki/Installing-Go#ubuntu-1404">https://github.com/ethereum/go-ethereum/wiki/Installing-Go#ubuntu-1404</a>
</p>

<p>
<a href="https://github.com/ethereum/go-ethereum/wiki/Private-network">https://github.com/ethereum/go-ethereum/wiki/Private-network</a>
</p>

<p>
<a href="https://github.com/ethereum/go-ethereum/wiki/Management-APIs">https://github.com/ethereum/go-ethereum/wiki/Management-APIs</a>
</p>
</div>
</div>

            </div>
            <!-- /.entry-content -->
        </article>
    </section>

        </div>
    </div>
</div>
<footer>
   <div class="container">
      <hr>
      <div class="row">
         <div class="col-xs-10">&copy; 2017 Qin Fengling
            &middot; Powered by <a href="https://github.com/getpelican/pelican-themes/tree/master/pelican-bootstrap3" target="_blank">pelican-bootstrap3</a>,
            <a href="http://docs.getpelican.com/" target="_blank">Pelican</a>,
            <a href="http://getbootstrap.com" target="_blank">Bootstrap</a>         </div>
         <div class="col-xs-2"><p class="pull-right"><i class="fa fa-arrow-up"></i> <a href="#">Back to top</a></p></div>
      </div>
   </div>
</footer>
<script src="./theme/js/jquery.min.js"></script>

<!-- Include all compiled plugins (below), or include individual files as needed -->
<script src="./theme/js/bootstrap.min.js"></script>

<!-- Enable responsive features in IE8 with Respond.js (https://github.com/scottjehl/Respond) -->
<script src="./theme/js/respond.min.js"></script>




</body>
</html>